nxp-mcuxpresso/mcux-sdk/devices/MKV56F24/mcuxpresso/startup_mkv56f24.c
WEAK void UART3_RX_TX_IRQHandler(void)
{   UART3_RX_TX_DriverIRQHandler();
}

WEAK void UART3_ERR_IRQHandler(void)
{   UART3_ERR_DriverIRQHandler();
}

WEAK void UART4_RX_TX_IRQHandler(void)
{   UART4_RX_TX_DriverIRQHandler();
}

WEAK void UART4_ERR_IRQHandler(void)
{   UART4_ERR_DriverIRQHandler();
}

WEAK void PIT0_IRQHandler(void)
{   PIT0_DriverIRQHandler();
}

WEAK void PIT1_IRQHandler(void)
{   PIT1_DriverIRQHandler();
}

WEAK void PIT2_IRQHandler(void)
{   PIT2_DriverIRQHandler();
}

WEAK void PIT3_IRQHandler(void)
{   PIT3_DriverIRQHandler();
}

WEAK void PDB0_IRQHandler(void)
{   PDB0_DriverIRQHandler();
}

WEAK void FTM2_IRQHandler(void)
{   FTM2_DriverIRQHandler();
}

WEAK void XBARA_IRQHandler(void)
{   XBARA_DriverIRQHandler();
}

WEAK void PDB1_IRQHandler(void)
{   PDB1_DriverIRQHandler();
}

WEAK void DAC0_IRQHandler(void)
{   DAC0_DriverIRQHandler();
}

WEAK void MCG_IRQHandler(void)
{   MCG_DriverIRQHandler();
}

WEAK void LPTMR0_IRQHandler(void)
{   LPTMR0_DriverIRQHandler();
}

WEAK void PORTA_IRQHandler(void)
{   PORTA_DriverIRQHandler();
}

WEAK void PORTB_IRQHandler(void)
{   PORTB_DriverIRQHandler();
}

WEAK void PORTC_IRQHandler(void)
{   PORTC_DriverIRQHandler();
}

WEAK void PORTD_IRQHandler(void)
{   PORTD_DriverIRQHandler();
}

WEAK void PORTE_IRQHandler(void)
{   PORTE_DriverIRQHandler();
}

WEAK void SWI_IRQHandler(void)
{   SWI_DriverIRQHandler();
}

WEAK void SPI2_IRQHandler(void)
{   SPI2_DriverIRQHandler();
}

WEAK void ENC_COMPARE_IRQHandler(void)
{   ENC_COMPARE_DriverIRQHandler();
}

WEAK void ENC_HOME_IRQHandler(void)
{   ENC_HOME_DriverIRQHandler();
}

WEAK void ENC_WDOG_SAB_IRQHandler(void)
{   ENC_WDOG_SAB_DriverIRQHandler();
}

WEAK void ENC_INDEX_IRQHandler(void)
{   ENC_INDEX_DriverIRQHandler();
}

WEAK void CMP2_IRQHandler(void)
{   CMP2_DriverIRQHandler();
}

WEAK void FTM3_IRQHandler(void)
{   FTM3_DriverIRQHandler();
}

WEAK void Reserved88_IRQHandler(void)
{   Reserved88_DriverIRQHandler();
}

WEAK void HSADC0_CCB_IRQHandler(void)
{   HSADC0_CCB_DriverIRQHandler();
}

WEAK void HSADC1_CCA_IRQHandler(void)
{   HSADC1_CCA_DriverIRQHandler();
}

WEAK void CAN0_ORed_Message_buffer_IRQHandler(void)
{   CAN0_DriverIRQHandler();
}

WEAK void CAN0_Bus_Off_IRQHandler(void)
{   CAN0_DriverIRQHandler();
}

WEAK void CAN0_Error_IRQHandler(void)
{   CAN0_DriverIRQHandler();
}

WEAK void CAN0_Tx_Warning_IRQHandler(void)
{   CAN0_DriverIRQHandler();
}

WEAK void CAN0_Rx_Warning_IRQHandler(void)
{   CAN0_DriverIRQHandler();
}

WEAK void CAN0_Wake_Up_IRQHandler(void)
{   CAN0_DriverIRQHandler();
}

WEAK void PWM0_CMP0_IRQHandler(void)
{   PWM0_CMP0_DriverIRQHandler();
}

WEAK void PWM0_RELOAD0_IRQHandler(void)
{   PWM0_RELOAD0_DriverIRQHandler();
}

WEAK void PWM0_CMP1_IRQHandler(void)
{   PWM0_CMP1_DriverIRQHandler();
}

WEAK void PWM0_RELOAD1_IRQHandler(void)
{   PWM0_RELOAD1_DriverIRQHandler();
}

WEAK void PWM0_CMP2_IRQHandler(void)
{   PWM0_CMP2_DriverIRQHandler();
}

WEAK void PWM0_RELOAD2_IRQHandler(void)
{   PWM0_RELOAD2_DriverIRQHandler();
}

WEAK void PWM0_CMP3_IRQHandler(void)
{   PWM0_CMP3_DriverIRQHandler();
}

WEAK void PWM0_RELOAD3_IRQHandler(void)
{   PWM0_RELOAD3_DriverIRQHandler();
}

WEAK void PWM0_CAP_IRQHandler(void)
{   PWM0_CAP_DriverIRQHandler();
}

WEAK void PWM0_RERR_IRQHandler(void)
{   PWM0_RERR_DriverIRQHandler();
}

WEAK void PWM0_FAULT_IRQHandler(void)
{   PWM0_FAULT_DriverIRQHandler();
}

WEAK void CMP3_IRQHandler(void)
{   CMP3_DriverIRQHandler();
}

WEAK void HSADC1_CCB_IRQHandler(void)
{   HSADC1_CCB_DriverIRQHandler();
}

WEAK void CAN1_ORed_Message_buffer_IRQHandler(void)
{   CAN1_DriverIRQHandler();
}

WEAK void CAN1_Bus_Off_IRQHandler(void)
{   CAN1_DriverIRQHandler();
}

WEAK void CAN1_Error_IRQHandler(void)
{   CAN1_DriverIRQHandler();
}

WEAK void CAN1_Tx_Warning_IRQHandler(void)
{   CAN1_DriverIRQHandler();
}

WEAK void CAN1_Rx_Warning_IRQHandler(void)
{   CAN1_DriverIRQHandler();
}

WEAK void CAN1_Wake_Up_IRQHandler(void)
{   CAN1_DriverIRQHandler();
}

WEAK void Reserved116_IRQHandler(void)
{   Reserved116_DriverIRQHandler();
}

WEAK void Reserved117_IRQHandler(void)
{   Reserved117_DriverIRQHandler();
}

WEAK void Reserved118_IRQHandler(void)
{   Reserved118_DriverIRQHandler();
}

WEAK void Reserved119_IRQHandler(void)
{   Reserved119_DriverIRQHandler();
}

WEAK void PWM1_CMP0_IRQHandler(void)
{   PWM1_CMP0_DriverIRQHandler();
}

WEAK void PWM1_RELOAD0_IRQHandler(void)
{   PWM1_RELOAD0_DriverIRQHandler();
}

WEAK void PWM1_CMP1_IRQHandler(void)
{   PWM1_CMP1_DriverIRQHandler();
}

WEAK void PWM1_RELOAD1_IRQHandler(void)
{   PWM1_RELOAD1_DriverIRQHandler();
}

WEAK void PWM1_CMP2_IRQHandler(void)
{   PWM1_CMP2_DriverIRQHandler();
}

WEAK void PWM1_RELOAD2_IRQHandler(void)
{   PWM1_RELOAD2_DriverIRQHandler();
}

WEAK void PWM1_CMP3_IRQHandler(void)
{   PWM1_CMP3_DriverIRQHandler();
}

WEAK void PWM1_RELOAD3_IRQHandler(void)
{   PWM1_RELOAD3_DriverIRQHandler();
}

WEAK void PWM1_CAP_IRQHandler(void)
{   PWM1_CAP_DriverIRQHandler();
}

WEAK void PWM1_RERR_IRQHandler(void)
{   PWM1_RERR_DriverIRQHandler();
}

WEAK void PWM1_FAULT_IRQHandler(void)
{   PWM1_FAULT_DriverIRQHandler();
}

//*****************************************************************************

#if defined (DEBUG)
#pragma GCC pop_options
#endif // (DEBUG)
